MyoMod/MyoMod-DPU/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
QSPI_Flash:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: L4, peripheral: FLEXSPI, signal: FLEXSPI_A_SCLK, pin_signal: GPIO_SD_B1_07}
  - {pin_num: P4, peripheral: FLEXSPI, signal: FLEXSPI_A_DATA2, pin_signal: GPIO_SD_B1_10}
  - {pin_num: P3, peripheral: FLEXSPI, signal: FLEXSPI_A_DATA0, pin_signal: GPIO_SD_B1_08}
  - {pin_num: N4, peripheral: FLEXSPI, signal: FLEXSPI_A_DATA1, pin_signal: GPIO_SD_B1_09}
  - {pin_num: L3, peripheral: FLEXSPI, signal: FLEXSPI_A_SS0_B, pin_signal: GPIO_SD_B1_06}
  - {pin_num: P5, peripheral: FLEXSPI, signal: FLEXSPI_A_DATA3, pin_signal: GPIO_SD_B1_11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : QSPI_Flash
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void QSPI_Flash(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           

  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_06_FLEXSPIA_SS0_B, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_07_FLEXSPIA_SCLK, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_08_FLEXSPIA_DATA00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_09_FLEXSPIA_DATA01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_10_FLEXSPIA_DATA02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_11_FLEXSPIA_DATA03, 0U); 
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RAM:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: B3, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA0, pin_signal: GPIO_EMC_26, identifier: ''}
  - {pin_num: A2, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA1, pin_signal: GPIO_EMC_27, identifier: ''}
  - {pin_num: D1, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA2, pin_signal: GPIO_EMC_28, identifier: ''}
  - {pin_num: E1, peripheral: FLEXSPI2, signal: FLEXSPI_A_DATA3, pin_signal: GPIO_EMC_29, identifier: ''}
  - {pin_num: A6, peripheral: FLEXSPI2, signal: FLEXSPI_B_DATA0, pin_signal: GPIO_EMC_13, identifier: ''}
  - {pin_num: B6, peripheral: FLEXSPI2, signal: FLEXSPI_B_DATA1, pin_signal: GPIO_EMC_14, identifier: ''}
  - {pin_num: B1, peripheral: FLEXSPI2, signal: FLEXSPI_B_DATA2, pin_signal: GPIO_EMC_15, identifier: ''}
  - {pin_num: A5, peripheral: FLEXSPI2, signal: FLEXSPI_B_DATA3, pin_signal: GPIO_EMC_16, identifier: ''}
  - {pin_num: D2, peripheral: FLEXSPI2, signal: FLEXSPI_A_SCLK, pin_signal: GPIO_EMC_25, identifier: ''}
  - {pin_num: G2, peripheral: FLEXSPI2, signal: FLEXSPI_A_DQS, pin_signal: GPIO_EMC_23, identifier: ''}
  - {pin_num: H1, peripheral: FLEXSPI2, signal: FLEXSPI_B_SCLK, pin_signal: GPIO_EMC_12, identifier: ''}
  - {pin_num: D3, peripheral: FLEXSPI2, signal: FLEXSPI_A_SS0_B, pin_signal: GPIO_EMC_24, identifier: ''}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RAM
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RAM(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           

  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_12_FLEXSPI2_B_SCLK, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_13_FLEXSPI2_B_DATA00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_14_FLEXSPI2_B_DATA01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_15_FLEXSPI2_B_DATA02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_16_FLEXSPI2_B_DATA03, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_23_FLEXSPI2_A_DQS, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_24_FLEXSPI2_A_SS0_B, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_25_FLEXSPI2_A_SCLK, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_26_FLEXSPI2_A_DATA00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_27_FLEXSPI2_A_DATA01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_28_FLEXSPI2_A_DATA02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_29_FLEXSPI2_A_DATA03, 0U); 
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
Boot_Config:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: F11, peripheral: SRC, signal: 'BOOT_MODE, 0', pin_signal: GPIO_AD_B0_04, identifier: ''}
  - {pin_num: G14, peripheral: SRC, signal: 'BOOT_MODE, 1', pin_signal: GPIO_AD_B0_05, identifier: ''}
  - {pin_num: C8, peripheral: SRC, signal: 'BOOT_CFG, 0', pin_signal: GPIO_B0_04, identifier: ''}
  - {pin_num: B8, peripheral: SRC, signal: 'BOOT_CFG, 1', pin_signal: GPIO_B0_05, identifier: ''}
  - {pin_num: A8, peripheral: SRC, signal: 'BOOT_CFG, 2', pin_signal: GPIO_B0_06, identifier: ''}
  - {pin_num: A9, peripheral: SRC, signal: 'BOOT_CFG, 3', pin_signal: GPIO_B0_07, identifier: ''}
  - {pin_num: B9, peripheral: SRC, signal: 'BOOT_CFG, 4', pin_signal: GPIO_B0_08, identifier: ''}
  - {pin_num: C9, peripheral: SRC, signal: 'BOOT_CFG, 5', pin_signal: GPIO_B0_09, identifier: ''}
  - {pin_num: D9, peripheral: SRC, signal: 'BOOT_CFG, 6', pin_signal: GPIO_B0_10}
  - {pin_num: A10, peripheral: SRC, signal: 'BOOT_CFG, 7', pin_signal: GPIO_B0_11, identifier: ''}
  - {pin_num: C10, peripheral: SRC, signal: 'BOOT_CFG, 8', pin_signal: GPIO_B0_12, identifier: ''}
  - {pin_num: D10, peripheral: SRC, signal: 'BOOT_CFG, 9', pin_signal: GPIO_B0_13, identifier: ''}
  - {pin_num: E10, peripheral: SRC, signal: 'BOOT_CFG, 10', pin_signal: GPIO_B0_14, identifier: ''}
  - {pin_num: E11, peripheral: SRC, signal: 'BOOT_CFG, 11', pin_signal: GPIO_B0_15, identifier: ''}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : Boot_Config
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void Boot_Config(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           

  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_04_SRC_BOOT_MODE00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_05_SRC_BOOT_MODE01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_04_SRC_BOOT_CFG00, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_05_SRC_BOOT_CFG01, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_06_SRC_BOOT_CFG02, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_07_SRC_BOOT_CFG03, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_08_SRC_BOOT_CFG04, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_09_SRC_BOOT_CFG05, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_10_SRC_BOOT_CFG06, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_11_SRC_BOOT_CFG07, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_12_SRC_BOOT_CFG08, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_13_SRC_BOOT_CFG09, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_14_SRC_BOOT_CFG10, 0U); 
  IOMUXC_SetPinMux(IOMUXC_GPIO_B0_15_SRC_BOOT_CFG11, 0U); 
}

